---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutRoof
source: html/5156f9a7-6bbe-cd23-ee99-c9a9d3317a21.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutRoof Property

The roof couldn't be cut.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutRoof { get; }
```